
  <details>
  <summary>Click to expand</summary>

  ```terraform
  module.lambda.data.archive_file.token_refresh: Reading...
module.lambda.data.archive_file.token_refresh: Read complete after 0s [id=0a5ee18200d6ef0f79a444d2e6b317a84ea4c7ca]
data.aws_region.current: Reading...
data.aws_caller_identity.current: Reading...
module.alb.aws_autoscaling_attachment.kong[0]: Refreshing state... [id=kubestock-workers-asg-20251209000321095400000001]
module.lambda.aws_iam_role.token_refresh: Refreshing state... [id=kubestock-token-refresh-lambda-role]
module.networking.aws_vpc.main: Refreshing state... [id=vpc-0a65a6bd6be2223dc]
module.observability.aws_s3_bucket.grafana_backups[0]: Refreshing state... [id=kubestock-grafana-backups-production]
module.observability.aws_s3_bucket.loki_logs: Refreshing state... [id=kubestock-loki-logs-production]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-identity"]: Refreshing state... [id=kubestock/ms-identity]
module.alb.aws_lb_target_group.kong: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-kong-tg/c5454f00896781bb]
data.aws_region.current: Read complete after 0s [id=ap-south-1]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-order-management"]: Refreshing state... [id=kubestock/ms-order-management]
data.aws_caller_identity.current: Read complete after 0s [id=478468757808]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-product"]: Refreshing state... [id=kubestock/ms-product]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-supplier"]: Refreshing state... [id=kubestock/ms-supplier]
module.alb.aws_wafv2_web_acl.main[0]: Refreshing state... [id=176e2677-e344-4107-b0f4-59a31fdccf5b]
module.ecr.aws_ecr_repository.microservices["kubestock/web"]: Refreshing state... [id=kubestock/web]
module.ecr.aws_ecr_repository.microservices["kubestock/ms-inventory"]: Refreshing state... [id=kubestock/ms-inventory]
module.ecr.aws_ecr_repository.microservices["kubestock/test-runner"]: Refreshing state... [id=kubestock/test-runner]
module.alb.aws_cloudwatch_log_group.waf[0]: Refreshing state... [id=aws-waf-logs-kubestock]
module.dns.aws_route53_zone.main[0]: Refreshing state... [id=Z098213613BRKGHT2D9AX]
module.secrets.aws_secretsmanager_secret.asgardeo["production"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/production/asgardeo-TaqYrp]
module.secrets.aws_secretsmanager_secret.asgardeo["staging"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/staging/asgardeo-wcyunr]
module.kubernetes.aws_iam_policy.k8s_ecr_pull: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-ecr-pull]
module.dns.aws_acm_certificate.main: Refreshing state... [id=arn:aws:acm:ap-south-1:478468757808:certificate/48f9081f-c8d7-4a5f-a3cc-d20705c734ab]
module.secrets.aws_iam_user.external_secrets: Refreshing state... [id=kubestock-external-secrets]
module.secrets.aws_secretsmanager_secret.alertmanager_slack["production"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/production/alertmanager/slack-glLxlt]
module.secrets.aws_secretsmanager_secret.alertmanager_slack["staging"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/staging/alertmanager/slack-9p8b2w]
module.compute.data.aws_ami.ubuntu: Reading...
module.rds.aws_db_parameter_group.postgres: Refreshing state... [id=kubestock-postgres-params]
module.cicd.data.aws_iam_openid_connect_provider.github_actions: Reading...
module.lambda.aws_cloudwatch_event_rule.token_refresh_schedule: Refreshing state... [id=kubestock-token-refresh-schedule]
module.compute.aws_key_pair.main: Refreshing state... [id=kubestock-key]
module.secrets.aws_secretsmanager_secret.test_runner: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/shared/test-runner-L9MQUD]
module.cicd.data.aws_iam_openid_connect_provider.github_actions: Read complete after 0s [id=arn:aws:iam::478468757808:oidc-provider/token.actions.githubusercontent.com]
module.observability.aws_s3_bucket.prometheus_metrics: Refreshing state... [id=kubestock-prometheus-metrics-production]
module.secrets.aws_secretsmanager_secret.db["production"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/production/db-P877dp]
module.secrets.aws_secretsmanager_secret.db["staging"]: Refreshing state... [id=arn:aws:secretsmanager:ap-south-1:478468757808:secret:kubestock/staging/db-TaqYrp]
module.kubernetes.aws_iam_policy.k8s_controllers: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-controllers-policy]
module.kubernetes.aws_iam_role.k8s_nodes: Refreshing state... [id=kubestock-node-role]
module.lambda.aws_lambda_function.token_refresh: Refreshing state... [id=kubestock-refresh-join-token]
module.compute.data.aws_ami.ubuntu: Read complete after 1s [id=ami-0ff91eb5c6fe7cc86]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/web"]: Refreshing state... [id=kubestock/web]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-identity"]: Refreshing state... [id=kubestock/ms-identity]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-inventory"]: Refreshing state... [id=kubestock/ms-inventory]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-product"]: Refreshing state... [id=kubestock/ms-product]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-order-management"]: Refreshing state... [id=kubestock/ms-order-management]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/ms-supplier"]: Refreshing state... [id=kubestock/ms-supplier]
module.ecr.aws_ecr_lifecycle_policy.microservices["kubestock/test-runner"]: Refreshing state... [id=kubestock/test-runner]
module.secrets.aws_iam_access_key.external_secrets: Refreshing state... [id=AKIAW6ZXV3EYOXZTGH2U]
module.networking.aws_internet_gateway.main: Refreshing state... [id=igw-01f445518c285bb47]
module.networking.aws_subnet.private[1]: Refreshing state... [id=subnet-0537648f14b08fae9]
module.networking.aws_subnet.public[0]: Refreshing state... [id=subnet-01240ef2e0b751289]
module.networking.aws_subnet.public[1]: Refreshing state... [id=subnet-0559dfc1c9f2ba26d]
module.networking.aws_subnet.public[2]: Refreshing state... [id=subnet-0577be992dc0ab111]
module.networking.aws_subnet.private[2]: Refreshing state... [id=subnet-0780d8e640722a270]
module.networking.aws_subnet.private[0]: Refreshing state... [id=subnet-0b1dc7ca3ea5b0331]
module.cicd.aws_iam_role.github_actions_ecr: Refreshing state... [id=KubeStock-github-actions-ecr-role]
module.lambda.aws_iam_policy.token_refresh: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-token-refresh-lambda-policy]
module.kubernetes.aws_iam_policy.k8s_external_secrets: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-k8s-external-secrets-policy]
module.secrets.aws_iam_policy.external_secrets_read: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-external-secrets-read]
module.dns.aws_route53_record.cert_validation["kubestock.dpiyumal.me"]: Refreshing state... [id=Z098213613BRKGHT2D9AX__6c5606c4dc00eaec2dba0b700893cd5f.kubestock.dpiyumal.me._CNAME]
module.dns.aws_route53_record.cert_validation["*.kubestock.dpiyumal.me"]: Refreshing state... [id=Z098213613BRKGHT2D9AX__6c5606c4dc00eaec2dba0b700893cd5f.kubestock.dpiyumal.me._CNAME]
module.kubernetes.aws_iam_role_policy_attachment.k8s_ecr_pull: Refreshing state... [id=kubestock-node-role-20251206093956675200000001]
module.kubernetes.aws_iam_instance_profile.k8s_nodes: Refreshing state... [id=kubestock-node-profile]
module.kubernetes.aws_iam_role_policy_attachment.k8s_nodes_ssm: Refreshing state... [id=kubestock-node-role-20251122171458069900000001]
module.kubernetes.aws_iam_role_policy.k8s_nodes_ssm_params: Refreshing state... [id=kubestock-node-role:k8s-nodes-ssm-policy]
module.kubernetes.aws_iam_role_policy_attachment.k8s_controllers: Refreshing state... [id=kubestock-node-role-20251122171458070500000002]
module.observability.aws_s3_bucket_server_side_encryption_configuration.grafana_backups[0]: Refreshing state... [id=kubestock-grafana-backups-production]
module.observability.aws_s3_bucket_public_access_block.grafana_backups[0]: Refreshing state... [id=kubestock-grafana-backups-production]
module.observability.aws_s3_bucket_versioning.grafana_backups[0]: Refreshing state... [id=kubestock-grafana-backups-production]
module.observability.aws_s3_bucket_lifecycle_configuration.loki_logs: Refreshing state... [id=kubestock-loki-logs-production]
module.observability.aws_s3_bucket_server_side_encryption_configuration.loki_logs: Refreshing state... [id=kubestock-loki-logs-production]
module.observability.aws_s3_bucket_public_access_block.loki_logs: Refreshing state... [id=kubestock-loki-logs-production]
module.observability.aws_s3_bucket_versioning.loki_logs: Refreshing state... [id=kubestock-loki-logs-production]
module.networking.aws_route_table.public: Refreshing state... [id=rtb-05c13f4e14ae0919a]
module.networking.aws_eip.nat: Refreshing state... [id=eipalloc-0343d1d2c3192b117]
module.lambda.aws_iam_role_policy_attachment.token_refresh: Refreshing state... [id=kubestock-token-refresh-lambda-role-20251130171832420000000001]
module.cicd.aws_iam_policy.github_actions_ecr: Refreshing state... [id=arn:aws:iam::478468757808:policy/KubeStock-github-actions-ecr-policy]
aws_route53_record.www: Refreshing state... [id=Z098213613BRKGHT2D9AX_www.kubestock.dpiyumal.me_CNAME]
module.kubernetes.aws_iam_role_policy_attachment.k8s_external_secrets: Refreshing state... [id=kubestock-node-role-20251206092316623400000001]
module.secrets.aws_iam_user_policy_attachment.external_secrets_read: Refreshing state... [id=kubestock-external-secrets-20251209040254987700000001]
module.lambda.aws_cloudwatch_event_target.token_refresh: Refreshing state... [id=kubestock-token-refresh-schedule-RefreshKubeToken]
module.lambda.aws_cloudwatch_log_group.token_refresh: Refreshing state... [id=/aws/lambda/kubestock-refresh-join-token]
module.lambda.aws_lambda_permission.allow_eventbridge: Refreshing state... [id=AllowEventBridgeInvoke]
module.dns.aws_acm_certificate_validation.main: Refreshing state... [id=2025-12-08 18:13:02.722 +0000 UTC]
module.security.aws_security_group.dev_server: Refreshing state... [id=sg-0d67ff044a38749c1]
module.security.aws_security_group.bastion: Refreshing state... [id=sg-0b8af5ccdc9c1d59a]
module.security.aws_security_group.k8s_common: Refreshing state... [id=sg-0b067e3fb603b11be]
module.security.aws_security_group.alb: Refreshing state... [id=sg-0c765a507d5d8e9b1]
module.kubernetes.aws_lb_target_group.kong_production_http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-kong-prod-http/01af04838651896a]
module.kubernetes.aws_lb_target_group.kong_production_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-kong-prod-https/9ae7e07d04b3250f]
module.kubernetes.aws_lb_target_group.grafana: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-grafana/25d228f2d887b44d]
module.kubernetes.aws_lb_target_group.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b]
module.kubernetes.aws_lb_target_group.kong_staging_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-kong-stg-https/3a8aecd6db59b4ca]
module.kubernetes.aws_lb_target_group.argocd_ui: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-argocd-ui/38727bd4aa6b3485]
module.kubernetes.aws_lb_target_group.prometheus: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-prometheus/3bfe5728d26c2afd]
module.kubernetes.aws_lb_target_group.kong_staging_http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-kong-stg-http/17dd7a2b40f9ab63]
module.kubernetes.aws_lb_target_group.alertmanager: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-alertmanager/787caf3b9bfa073a]
module.networking.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-032368bbbbdbffa70]
module.networking.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-072cb499e6ec152fc]
module.networking.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0382b6c798e2559df]
module.cicd.aws_iam_role_policy_attachment.github_actions_ecr: Refreshing state... [id=KubeStock-github-actions-ecr-role-20251125155745016000000001]
module.alb.aws_wafv2_web_acl_logging_configuration.main[0]: Refreshing state... [id=arn:aws:wafv2:ap-south-1:478468757808:regional/webacl/kubestock-waf/176e2677-e344-4107-b0f4-59a31fdccf5b]
module.networking.aws_nat_gateway.main: Refreshing state... [id=nat-054ea26583c09fb63]
module.security.aws_security_group.nlb_api: Refreshing state... [id=sg-0a439eecb4c77e2c3]
module.observability.aws_s3_bucket_lifecycle_configuration.prometheus_metrics: Refreshing state... [id=kubestock-prometheus-metrics-production]
module.observability.aws_s3_bucket_versioning.prometheus_metrics: Refreshing state... [id=kubestock-prometheus-metrics-production]
module.observability.aws_iam_policy.observability_s3_access: Refreshing state... [id=arn:aws:iam::478468757808:policy/kubestock-observability-s3-access-production]
module.observability.aws_s3_bucket_server_side_encryption_configuration.prometheus_metrics: Refreshing state... [id=kubestock-prometheus-metrics-production]
module.observability.aws_s3_bucket_public_access_block.prometheus_metrics: Refreshing state... [id=kubestock-prometheus-metrics-production]
module.rds.aws_db_subnet_group.main: Refreshing state... [id=kubestock-db-subnet-group]
module.observability.aws_iam_role_policy_attachment.observability_to_workers[0]: Refreshing state... [id=kubestock-node-role-20251209182450645900000001]
module.compute.aws_instance.dev_server: Refreshing state... [id=i-04e12e9ae223d0486]
module.compute.aws_instance.bastion: Refreshing state... [id=i-04022600baf393bd3]
module.alb.aws_lb.main: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/app/kubestock-alb/cc495d5fcf90a37c]
module.networking.aws_route_table.private[0]: Refreshing state... [id=rtb-06f165d277305b4f2]
module.networking.aws_route_table.private[2]: Refreshing state... [id=rtb-04b01b74ef23587e6]
module.networking.aws_route_table.private[1]: Refreshing state... [id=rtb-0b5da2e36e8f81b57]
module.security.aws_security_group.control_plane: Refreshing state... [id=sg-0ac3836e0f42135fb]
module.security.aws_security_group.workers: Refreshing state... [id=sg-08b85cb7308f90c2f]
module.kubernetes.aws_lb.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/net/kubestock-nlb/e316550036e3d7d8]
module.networking.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0861217d4449ff33d]
module.networking.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0899b49bc97142ad1]
module.networking.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-05cd7e585640a44e2]
module.security.aws_security_group.rds: Refreshing state... [id=sg-0beb81e7082e092e4]
module.kubernetes.aws_instance.control_plane: Refreshing state... [id=i-08ff658102a4848d6]
module.kubernetes.aws_launch_template.k8s_worker: Refreshing state... [id=lt-01159ecec1ce86876]
module.alb.aws_wafv2_web_acl_association.main[0]: Refreshing state... [id=arn:aws:wafv2:ap-south-1:478468757808:regional/webacl/kubestock-waf/176e2677-e344-4107-b0f4-59a31fdccf5b,arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/app/kubestock-alb/cc495d5fcf90a37c]
aws_route53_record.app: Refreshing state... [id=Z098213613BRKGHT2D9AX_kubestock.dpiyumal.me_A]
module.alb.aws_lb_listener.http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/app/kubestock-alb/cc495d5fcf90a37c/505471d80eba3abd]
module.rds.aws_db_instance.staging: Refreshing state... [id=db-3X4DF5ESJAZVG6SGKJTFFOT2C4]
module.rds.aws_db_instance.production: Refreshing state... [id=db-BCZAHFE3G7WAETSZHTIH4JRG6M]
module.kubernetes.aws_autoscaling_group.k8s_workers: Refreshing state... [id=kubestock-workers-asg]
module.kubernetes.aws_lb_listener.kong_production_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/c1cab2ec69658bf2]
module.kubernetes.aws_lb_listener.argocd_ui: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/16d41a2889481d6b]
module.kubernetes.aws_lb_listener.grafana: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/3de6ff9ff937110e]
module.kubernetes.aws_lb_listener.kong_staging_http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/9505cdc6cbbb4180]
module.kubernetes.aws_lb_listener.prometheus: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/f9fe692eb5a66463]
module.kubernetes.aws_lb_listener.kong_production_http: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/44bf5730cd6223f6]
module.kubernetes.aws_lb_listener.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/49f9cbf2bf8629d1]
module.kubernetes.aws_lb_listener.alertmanager: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/e378e28b78282709]
module.kubernetes.aws_lb_listener.kong_staging_https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/net/kubestock-nlb/e316550036e3d7d8/1c1ea2ad415f890f]
module.kubernetes.aws_autoscaling_attachment.grafana: Refreshing state... [id=kubestock-workers-asg-20251209181553557900000001]
module.kubernetes.aws_autoscaling_attachment.argocd_ui: Refreshing state... [id=kubestock-workers-asg-20251206213236904600000002]
module.kubernetes.aws_autoscaling_attachment.kong_staging_https: Refreshing state... [id=kubestock-workers-asg-20251209011910050600000004]
module.kubernetes.aws_autoscaling_attachment.kong_production_https: Refreshing state... [id=kubestock-workers-asg-20251209011909884800000001]
module.kubernetes.aws_autoscaling_attachment.alertmanager: Refreshing state... [id=kubestock-workers-asg-20251209181553580400000003]
module.kubernetes.aws_autoscaling_attachment.kong_production_http: Refreshing state... [id=kubestock-workers-asg-20251209011909959600000002]
module.kubernetes.aws_autoscaling_attachment.prometheus: Refreshing state... [id=kubestock-workers-asg-20251209181553575600000002]
module.kubernetes.aws_autoscaling_attachment.kong_staging_http: Refreshing state... [id=kubestock-workers-asg-20251209011910034200000003]
module.alb.aws_lb_listener.https: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/app/kubestock-alb/cc495d5fcf90a37c/06226ca4d0dee0f1]
module.compute.aws_eip.bastion: Refreshing state... [id=eipalloc-0e7b598a9492e3186]
module.compute.aws_eip.dev_server: Refreshing state... [id=eipalloc-056c594e35c87a208]
module.kubernetes.aws_lb_target_group_attachment.k8s_api: Refreshing state... [id=arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-k8s-api-tg/0247a93887c9714b-2025112217153294790000000a]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy

Terraform will perform the following actions:

  # module.alb.aws_autoscaling_attachment.istio[0] will be created
  + resource "aws_autoscaling_attachment" "istio" {
      + autoscaling_group_name = "kubestock-workers-asg"
      + id                     = (known after apply)
      + lb_target_group_arn    = (known after apply)
    }

  # module.alb.aws_autoscaling_attachment.kong[0] will be destroyed
  # (because aws_autoscaling_attachment.kong is not in configuration)
  - resource "aws_autoscaling_attachment" "kong" {
      - autoscaling_group_name = "kubestock-workers-asg" -> null
      - id                     = "kubestock-workers-asg-20251209000321095400000001" -> null
      - lb_target_group_arn    = "arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-kong-tg/c5454f00896781bb" -> null
    }

  # module.alb.aws_lb_listener.https will be updated in-place
  ~ resource "aws_lb_listener" "https" {
        id                                                                    = "arn:aws:elasticloadbalancing:ap-south-1:478468757808:listener/app/kubestock-alb/cc495d5fcf90a37c/06226ca4d0dee0f1"
        tags                                                                  = {
            "Name" = "kubestock-https-listener"
        }
        # (26 unchanged attributes hidden)

      ~ default_action {
          ~ target_group_arn = "arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-kong-tg/c5454f00896781bb" -> (known after apply)
            # (2 unchanged attributes hidden)
        }

        # (1 unchanged block hidden)
    }

  # module.alb.aws_lb_target_group.istio will be created
  + resource "aws_lb_target_group" "istio" {
      + arn                                = (known after apply)
      + arn_suffix                         = (known after apply)
      + connection_termination             = (known after apply)
      + deregistration_delay               = "300"
      + id                                 = (known after apply)
      + ip_address_type                    = (known after apply)
      + lambda_multi_value_headers_enabled = false
      + load_balancer_arns                 = (known after apply)
      + load_balancing_algorithm_type      = (known after apply)
      + load_balancing_anomaly_mitigation  = (known after apply)
      + load_balancing_cross_zone_enabled  = (known after apply)
      + name                               = "kubestock-istio-tg"
      + name_prefix                        = (known after apply)
      + port                               = 30080
      + preserve_client_ip                 = (known after apply)
      + protocol                           = "HTTP"
      + protocol_version                   = (known after apply)
      + proxy_protocol_v2                  = false
      + slow_start                         = 0
      + tags                               = {
          + "Environment" = "production"
          + "Name"        = "kubestock-istio-tg"
        }
      + tags_all                           = {
          + "Environment" = "production"
          + "ManagedBy"   = "Terraform"
          + "Name"        = "kubestock-istio-tg"
          + "Project"     = "KubeStock"
        }
      + target_type                        = "instance"
      + vpc_id                             = "vpc-0a65a6bd6be2223dc"

      + health_check {
          + enabled             = true
          + healthy_threshold   = 2
          + interval            = 30
          + matcher             = "200"
          + path                = "/healthz/ready"
          + port                = "15021"
          + protocol            = "HTTP"
          + timeout             = 5
          + unhealthy_threshold = 3
        }

      + stickiness {
          + cookie_duration = 86400
          + enabled         = false
          + type            = "lb_cookie"
        }

      + target_failover (known after apply)

      + target_group_health (known after apply)

      + target_health_state (known after apply)
    }

  # module.alb.aws_lb_target_group.kong will be destroyed
  # (because aws_lb_target_group.kong is not in configuration)
  - resource "aws_lb_target_group" "kong" {
      - arn                                = "arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-kong-tg/c5454f00896781bb" -> null
      - arn_suffix                         = "targetgroup/kubestock-kong-tg/c5454f00896781bb" -> null
      - deregistration_delay               = "300" -> null
      - id                                 = "arn:aws:elasticloadbalancing:ap-south-1:478468757808:targetgroup/kubestock-kong-tg/c5454f00896781bb" -> null
      - ip_address_type                    = "ipv4" -> null
      - lambda_multi_value_headers_enabled = false -> null
      - load_balancer_arns                 = [
          - "arn:aws:elasticloadbalancing:ap-south-1:478468757808:loadbalancer/app/kubestock-alb/cc495d5fcf90a37c",
        ] -> null
      - load_balancing_algorithm_type      = "round_robin" -> null
      - load_balancing_anomaly_mitigation  = "off" -> null
      - load_balancing_cross_zone_enabled  = "use_load_balancer_configuration" -> null
      - name                               = "kubestock-kong-tg" -> null
      - port                               = 30080 -> null
      - protocol                           = "HTTP" -> null
      - protocol_version                   = "HTTP1" -> null
      - proxy_protocol_v2                  = false -> null
      - slow_start                         = 0 -> null
      - tags                               = {
          - "Environment" = "production"
          - "Name"        = "kubestock-kong-tg"
        } -> null
      - tags_all                           = {
          - "Environment" = "production"
          - "ManagedBy"   = "Terraform"
          - "Name"        = "kubestock-kong-tg"
          - "Project"     = "KubeStock"
        } -> null
      - target_type                        = "instance" -> null
      - vpc_id                             = "vpc-0a65a6bd6be2223dc" -> null
        # (1 unchanged attribute hidden)

      - health_check {
          - enabled             = true -> null
          - healthy_threshold   = 2 -> null
          - interval            = 30 -> null
          - matcher             = "200,404" -> null
          - path                = "/api/gateway/health" -> null
          - port                = "traffic-port" -> null
          - protocol            = "HTTP" -> null
          - timeout             = 5 -> null
          - unhealthy_threshold = 3 -> null
        }

      - stickiness {
          - cookie_duration = 86400 -> null
          - enabled         = false -> null
          - type            = "lb_cookie" -> null
            # (1 unchanged attribute hidden)
        }

      - target_failover {}

      - target_group_health {
          - dns_failover {
              - minimum_healthy_targets_count      = "1" -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
          - unhealthy_state_routing {
              - minimum_healthy_targets_count      = 1 -> null
              - minimum_healthy_targets_percentage = "off" -> null
            }
        }

      - target_health_state {}
    }

Plan: 2 to add, 1 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```

  </details>
        